docs/sessions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-19 dom 17:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Perl 6, the Sessions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Juan J. merelo" />
</head>
<body>
<div id="content">
<h1 class="title">Perl 6, the Sessions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9111945">1. Empathy session (30 minutes)</a></li>
<li><a href="#orgc731c5b">2. Ideas session (30 minutes)</a></li>
<li><a href="#org405aac0">3. Tools (30 minutes+)</a></li>
<li><a href="#org6ab3edf">4. Perl 6 (30 minutes)</a>
<ul>
<li><a href="#orgf680d1c">4.1. Actual development</a></li>
</ul>
</li>
<li><a href="#org7f3bff4">5. What is free software (30 minutes)</a></li>
<li><a href="#orgac5480a">6. Teamwork with git (30 minutes)</a>
<ul>
<li><a href="#orgb0ffdd8">6.1. Actual development</a></li>
</ul>
</li>
<li><a href="#orgeb48dfd">7. What we know so far</a>
<ul>
<li><a href="#org846cc5b">7.1. Actual development</a></li>
<li><a href="#org9be4b1e">7.2. Conclusions so far</a></li>
</ul>
</li>
<li><a href="#org1753796">8. Let's work with the REPL</a>
<ul>
<li><a href="#orgd5ca073">8.1. Actual development</a></li>
</ul>
</li>
<li><a href="#org8c00d8b">9. Working with other kind of data</a>
<ul>
<li><a href="#orgd654370">9.1. Actual development</a></li>
</ul>
</li>
<li><a href="#orgb4ffbf8">10. Series of things (30 minutes)</a>
<ul>
<li><a href="#org2842978">10.1. Actual session</a></li>
</ul>
</li>
<li><a href="#org2b30ebd">11. Working with repositories</a>
<ul>
<li><a href="#org8c2e4cc">11.1. Actual session</a></li>
</ul>
</li>
<li><a href="#orgdf2be5b">12. A series of sequences</a>
<ul>
<li><a href="#org1807fc9">12.1. Actual session</a></li>
</ul>
</li>
<li><a href="#orgf87b181">13. Documentation is important</a>
<ul>
<li><a href="#orgcde2002">13.1. Actual development</a></li>
</ul>
</li>
<li><a href="#org044d107">14. Card shuffle</a>
<ul>
<li><a href="#org3355b41">14.1. Actual development</a></li>
</ul>
</li>
<li><a href="#org1f3c5de">15. It is so true</a>
<ul>
<li><a href="#orgf00dfd1">15.1. Actual development</a></li>
</ul>
</li>
<li><a href="#org5a5f7b0">16. Filtering things</a>
<ul>
<li><a href="#org16bbe2c">16.1. Actual development</a></li>
</ul>
</li>
<li><a href="#org51f697a">17. Computational thinking</a></li>
<li><a href="#orge390925">18. Back to the command line</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9111945" class="outline-2">
<h2 id="org9111945"><span class="section-number-2">1</span> Empathy session (30 minutes)</h2>
<div class="outline-text-2" id="text-1">
<p>
Took place Dec 6th, 11:30AM, in the kitchen. We talked about what kind
of things can be done, introduced the whole <i>course</i> (air quotes
here), and talked about how everything is going to work.
</p>
</div>
</div>

<div id="outline-container-orgc731c5b" class="outline-2">
<h2 id="orgc731c5b"><span class="section-number-2">2</span> Ideas session (30 minutes)</h2>
<div class="outline-text-2" id="text-2">
<p>
Dec 8th, 11:00 AM. 
</p>

<p>
Let's go into the ideation phase, while not leaving the immersion phase <a href="http://www.mjvinnovation.com/blog/three-phases-design-thinking-immersion-ideation-prototyping">http://www.mjvinnovation.com/blog/three-phases-design-thinking-immersion-ideation-prototyping</a>
</p>
</div>
</div>

<div id="outline-container-org405aac0" class="outline-2">
<h2 id="org405aac0"><span class="section-number-2">3</span> Tools (30 minutes+)</h2>
<div class="outline-text-2" id="text-3">
<p>
Set up tools, starting with the editor. Atom, emacs, anything like
that, command line, how to work with it, minimal Linux, which is the
environment of choice. 
</p>
</div>
</div>
<div id="outline-container-org6ab3edf" class="outline-2">
<h2 id="org6ab3edf"><span class="section-number-2">4</span> Perl 6 (30 minutes)</h2>
<div class="outline-text-2" id="text-4">
<p>
Set it up, understand the REPL. 
</p>

<p>
Install rakudobrew and start to work with it. Class itself took like
15 minutes, and the rest was devoted to compiling latest version of
MoarVM. Note: the $ in the documentation can be mistaken for a
command.  
</p>
</div>

<div id="outline-container-orgf680d1c" class="outline-3">
<h3 id="orgf680d1c"><span class="section-number-3">4.1</span> Actual development</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is written way after it took place. And I do not remember
anything, so I guess it must have been rather uneventful. 
</p>
</div>
</div>
</div>

<div id="outline-container-org7f3bff4" class="outline-2">
<h2 id="org7f3bff4"><span class="section-number-2">5</span> What is free software (30 minutes)</h2>
<div class="outline-text-2" id="text-5">
<p>
Probably a good talk for a Sunday morning. What is free software and
free licenses, what they mean, what it's like to create and produce
free software, why everything we do when learning a language should be
free so that other benefit from it.  
</p>

<p>
We are telling the story of Java, how it is about to become the cash
crop of Oracle who's attempting to ask for licenses, and what kind of
licenses here are and what we should do about it. 
</p>
</div>
</div>


<div id="outline-container-orgac5480a" class="outline-2">
<h2 id="orgac5480a"><span class="section-number-2">6</span> Teamwork with git (30 minutes)</h2>
<div class="outline-text-2" id="text-6">
<p>
The first part of this session should be used to create an ID with
GitHub or, if that's created already, to create repositories that will
be used to host the assignments and other tests. We will also learn to
collaborate using Markdown. 
</p>

<p>
An issue in this session is to learn to use the correct license, or at
least a license, for the work that will be done. A side effect is to
learn and use GitHub as a place to look for code, and how to fork a
repository to work on it. Pull requests, if time allows, if it does
not, let's yield to the next session.
</p>
</div>

<div id="outline-container-orgb0ffdd8" class="outline-3">
<h3 id="orgb0ffdd8"><span class="section-number-3">6.1</span> Actual development</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Sign up for GitHub, create a repository and actually <b>do nothing</b> with
it. Look up Perl6 and other repos, and modify them and create pull
requests. 
</p>

<p>
Unexpected hurdles (actually I have found this before): giving the
repository a name, finding something to do a pull request, things like
that. 
</p>
</div>
</div>
</div>


<div id="outline-container-orgeb48dfd" class="outline-2">
<h2 id="orgeb48dfd"><span class="section-number-2">7</span> What we know so far</h2>
<div class="outline-text-2" id="text-7">
<p>
Writeup of what we have learned so far and what we want to
learn. Probably "home" assignment. 
</p>
</div>


<div id="outline-container-org846cc5b" class="outline-3">
<h3 id="org846cc5b"><span class="section-number-3">7.1</span> Actual development</h3>
<div class="outline-text-3" id="text-7-1">
<p>
We have talked about free software, a bit about Perl6, a bit
about teamwork&#x2026; Some are getting impatient over the actual lack of
learning Perl6. So we'll have to go to that soon. Also talked a bit
about <a href="https://github.com/ajs/perl6-Math-Sequences">Working on a
Library about sequences</a>. A pull request that, BTW, was accepted
just today, on Christmas Day. 
</p>

<p>
The home assignment did not go so well. One turned it in early, one a
bit after the next session, one did not do it at all. Still doing it,
weeks after, in fact. 
</p>
</div>
</div>

<div id="outline-container-org9be4b1e" class="outline-3">
<h3 id="org9be4b1e"><span class="section-number-3">7.2</span> Conclusions so far</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Maybe we are out-zenning a bit with doing 7 sessions
 without a real hint of what Perl6, or for that matter any other
 language, is about. 
</p>
</div>
</div>
</div>

<div id="outline-container-org1753796" class="outline-2">
<h2 id="org1753796"><span class="section-number-2">8</span> Let's work with the REPL</h2>
<div class="outline-text-2" id="text-8">
<p>
First, do some basic stuff, calculator style. Then realize that you
can't go back to what we wrote before to correct or whatever; then
install linenoise with
</p>

<div class="org-src-container">
<pre class="src src-bash">zef install Linenoise
</pre>
</div>

<p>
Explain Unicode and what it means for modern computing. Test some
Unicode codepoints. 
</p>

<p>
Play with operators for a while. 
</p>

<p>
Hint also at types and why ar they different and what it means for
operations. use <code>.WHAT</code>, as in
</p>


<div class="org-src-container">
<pre class="src src-perl6"><span style="color: #cccccc; background-color: #181a26;">&#960;</span><span style="color: #f08080;">.</span><span style="color: #cccccc; background-color: #181a26;">WHAT</span>
</pre>
</div>

<p>
You'll have to find a way to type π. Probably a good option is to do
it inside emacs. But the most straightforward is to look for "unicode
symbols" in Google and copy/paste it. You can do the same with other Unicode symbols such as ⅓ or ⅕. 
</p>
</div>

<div id="outline-container-orgd5ca073" class="outline-3">
<h3 id="orgd5ca073"><span class="section-number-3">8.1</span> Actual development</h3>
<div class="outline-text-3" id="text-8-1">
<p>
We have discovered that <code>rakudobrew</code> was not properly installed and had a lot of fun after configuring a Compose key in Gnome. <a href="https://help.ubuntu.com/community/ComposeKey">Here's how to do it.</a>
We eventually did some simple operations, including working with
Unicode characters. Also accessing the Javascript REPL that is
included in Firefox, and checking out how some things work, and some
others, mainly including the funny Unicode characters, do not. 
</p>
</div>
</div>
</div>
