sessions.org
* Working with other kind of data
   :PROPERTIES:
   :Tools:    Laptop
   :Chapter:  3
   :END:

Let's have a go to working with strings, and rationals, and use
=.WHAT= to find out the type of data. Start to work with sequences,
and cool things that can be done with them, including, maybe in this
session, infinite sequences. 

** Actual development

The thing is, come this point, everyone must have tools ready. One
could not use Linenoise to access previous expressions, and it had to
be set up. Besides, by now we are using Greek and other letter by the
bushel and we can't just go to the Internet every time we need a φ. So
we have learned to use the shell from emacs, and also to use the key
combo Control-X + 8 + Enter and then the name of the letter. That way
we can also go ahead and use the three periods and infinity and other
needed.

Eventually we have started with lists, using indices in lists, and so
on. But just barely. No time to define sequences, little by little.

Also, someone is getting impatient wanting to save work, things like
that. Ah, impatience...

* Series of things (30 minutes)
  :PROPERTIES:
   :Tools:    Laptop
   :Chapter:  2
   :END:

First some non-conventional operators such as =x= and then let's proceed to talk about sequences and arrays and how to deal with infinite arrays. 

** Actual session

Some trouble with syntax, which gets in the way. Spaces where they should not be, points less or more, problems with key combinations for Greek letters... all that stuff. But pretty much, a lot done in half an hour. 
* Working with repositories
  :PROPERTIES:
  :Tools:    Laptop
  :Chapter:  3
  :END:

After the last session, where homework was introduced for the first time, we are going to work with files in repositories, which is where they should be. We will learn 

    - Download the repository to local filesystem using =git clone=
    - Add a file to the repository with =git add=
    - Record changes to the repository with =git commit=
    - Synchronize local with global repository using =git push=
    - Fork and work with other's repositories
    - Accept pull requests and pull changes into local repository with =git pull=

** Actual session

We used the "lessons learned" file that we had compiled in every
session and we had a lot of fun. One of us had just copied the Emacs
tutorial stuff, some others were corrected, we performad every
intended objective. Only unexpected thing was that git was not
configured and that we really, really, need to navigate the Linux
filesystem. 

A funny unintended consequence of all this is that is easier to learn
from scratch that to /unlearn/ what has been learned, so that newbies
perform /better/ than those that have had some access to bad
learning. Yes, it's a real WTF. 

* A series of sequences
  :PROPERTIES:
  :Tools:    Laptop
  :Chapter:  4
  :END:

Knowing about the "Reduce" operator on sequences (or ranges) and combining sequences to give new sequences. Also, recursive sequences.

** Actual session

This starts to be a little complicated. Also boring. But mostly complicated. When you are getting in some complexity, but mainly working over the same essential material, which is sequences, you start to get a bit fed up with it. So maybe we will switch to ancillary material next ocassion. 
Anyway, the concept of crossing and zipping has been caught fast by using the zipper metaphor and hand-weaving. So let us call it a day and let us go to greener pastures.

The fact that we still have not stored anything so far has not been an obstacle. No program has been written, and none has been needed. 

Repeating same things over and over is also important. Sequences of commands like opening a shell inside Emacs and typing Perl6 sometimes do not happen and need some help. 

A bit of homework: create a sequence of apartment coordinates
combining house number + floor + letter. To be turned in in a Repo. 

This has ended up in chapter 4. I will have to renumber everything. 

* Documentation is important
  :PROPERTIES:
  :Tools:    Laptop
  :Chapter:  4
  :END:

Let's learn a bit about markdown and other simple markup languages
using the Wikipedia and the "Lessons learned" file we have been
working on for some time. A few words on how to link, on how to evolve
the documentation, how to evolve it along the rest of the programs,
and on how to generate better-quality documents 
from them. Spell check, things like that.

At the same time, practice familiarity with the filesystem and
navigating in it. For instance, navigate using Nautilus and them, open
the menu and click in "Open in a terminal". Filesystem navigation is a
very necessary skill, and one that is sometimes lacking in traditional
programming. 

** Actual development
This was scheduled for January 6th, we are being kind of intensive
lately. But it is gift-giving day in Spain and we played at one of the
games  that was given. Maybe an ocassion to gamify learning, but I
failed to see how. 

* Card shuffle
  :PROPERTIES:
  :Tools:    Laptop
  :Chapter:  4
  :END:

Talk about different ways of picking random elements out of an array,
or a whole bunch of them. The single objective of this class will be
to create a deck of French cards using the correct Unicode symbols and
all, and then an expression to shuffle them. 

Finally, it will be saved as a [[https://gist.github.com][gist]] and shown to everyone for
comments. The /gist/ will have to be written in Markdown, with a
description of what it is and a step-by-step explanation of the
expression. 

** Actual development

This has been an amazing session. With very little new material, just
=pick= and =roll=, it was about putting to practice what had been done
so far, including documentation and using GitHub for publishing
things. 

The dynamics was mostly self-organized, and with three persons, two
teams have been created. This the [[https://t.co/nUspT3ohZ1][first result]] and the
[[https://gist.github.com/ElenaMerelo/3903f46a2d492dd0b76151054a598721][second team]]. They have had a lot of fun while they were doing it, and
also while writing it down in Markdown. Different solutions, different
ways of understanding the structures, but all in all it shows that
Perl 6 is a great language, allowing to do things in very different
ways. Informative error messages also help quite a lot to get things
right. 

* It is so true
  :PROPERTIES:
  :Tools:    Laptop
  :Chapter:  5
  :END:

Learning a bit about Boolean values and how to work with them. I am
not sure how to proceed with this. We can do it fast or we can do it
good. It's probably better if we do it fast. 

The basic ideas is how Boolean types are the results of checks, and
what kind of things are considered true and not true. Also a primer on
unary/preffix operators and how to call them.  

