docs/sessions.html




<div id="outline-container-org8c00d8b" class="outline-2">
<h2 id="org8c00d8b"><span class="section-number-2">9</span> Working with other kind of data</h2>
<div class="outline-text-2" id="text-9">
<p>
Let's have a go to working with strings, and rationals, and use
<code>.WHAT</code> to find out the type of data. Start to work with sequences,
and cool things that can be done with them, including, maybe in this
session, infinite sequences. 
</p>
</div>

<div id="outline-container-orgd654370" class="outline-3">
<h3 id="orgd654370"><span class="section-number-3">9.1</span> Actual development</h3>
<div class="outline-text-3" id="text-9-1">
<p>
The thing is, come this point, everyone must have tools ready. One
could not use Linenoise to access previous expressions, and it had to
be set up. Besides, by now we are using Greek and other letter by the
bushel and we can't just go to the Internet every time we need a φ. So
we have learned to use the shell from emacs, and also to use the key
combo Control-X + 8 + Enter and then the name of the letter. That way
we can also go ahead and use the three periods and infinity and other
needed.
</p>

<p>
Eventually we have started with lists, using indices in lists, and so
on. But just barely. No time to define sequences, little by little.
</p>

<p>
Also, someone is getting impatient wanting to save work, things like
that. Ah, impatience&#x2026;
</p>
</div>
</div>
</div>

<div id="outline-container-orgb4ffbf8" class="outline-2">
<h2 id="orgb4ffbf8"><span class="section-number-2">10</span> Series of things (30 minutes)</h2>
<div class="outline-text-2" id="text-10">
<p>
First some non-conventional operators such as <code>x</code> and then let's proceed to talk about sequences and arrays and how to deal with infinite arrays. 
</p>
</div>

<div id="outline-container-org2842978" class="outline-3">
<h3 id="org2842978"><span class="section-number-3">10.1</span> Actual session</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Some trouble with syntax, which gets in the way. Spaces where they should not be, points less or more, problems with key combinations for Greek letters&#x2026; all that stuff. But pretty much, a lot done in half an hour. 
</p>
</div>
</div>
</div>
<div id="outline-container-org2b30ebd" class="outline-2">
<h2 id="org2b30ebd"><span class="section-number-2">11</span> Working with repositories</h2>
<div class="outline-text-2" id="text-11">
<p>
After the last session, where homework was introduced for the first time, we are going to work with files in repositories, which is where they should be. We will learn 
</p>

<ul class="org-ul">
<li>Download the repository to local filesystem using <code>git clone</code></li>
<li>Add a file to the repository with <code>git add</code></li>
<li>Record changes to the repository with <code>git commit</code></li>
<li>Synchronize local with global repository using <code>git push</code></li>
<li>Fork and work with other's repositories</li>
<li>Accept pull requests and pull changes into local repository with <code>git pull</code></li>
</ul>
</div>

<div id="outline-container-org8c2e4cc" class="outline-3">
<h3 id="org8c2e4cc"><span class="section-number-3">11.1</span> Actual session</h3>
<div class="outline-text-3" id="text-11-1">
<p>
We used the "lessons learned" file that we had compiled in every
session and we had a lot of fun. One of us had just copied the Emacs
tutorial stuff, some others were corrected, we performad every
intended objective. Only unexpected thing was that git was not
configured and that we really, really, need to navigate the Linux
filesystem. 
</p>

<p>
A funny unintended consequence of all this is that is easier to learn
from scratch that to <i>unlearn</i> what has been learned, so that newbies
perform <i>better</i> than those that have had some access to bad
learning. Yes, it's a real WTF. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgdf2be5b" class="outline-2">
<h2 id="orgdf2be5b"><span class="section-number-2">12</span> A series of sequences</h2>
<div class="outline-text-2" id="text-12">
<p>
Knowing about the "Reduce" operator on sequences (or ranges) and combining sequences to give new sequences. Also, recursive sequences.
</p>
</div>

<div id="outline-container-org1807fc9" class="outline-3">
<h3 id="org1807fc9"><span class="section-number-3">12.1</span> Actual session</h3>
<div class="outline-text-3" id="text-12-1">
<p>
This starts to be a little complicated. Also boring. But mostly complicated. When you are getting in some complexity, but mainly working over the same essential material, which is sequences, you start to get a bit fed up with it. So maybe we will switch to ancillary material next ocassion. 
Anyway, the concept of crossing and zipping has been caught fast by using the zipper metaphor and hand-weaving. So let us call it a day and let us go to greener pastures.
</p>

<p>
The fact that we still have not stored anything so far has not been an obstacle. No program has been written, and none has been needed. 
</p>

<p>
Repeating same things over and over is also important. Sequences of commands like opening a shell inside Emacs and typing Perl6 sometimes do not happen and need some help. 
</p>

<p>
A bit of homework: create a sequence of apartment coordinates
combining house number + floor + letter. To be turned in in a Repo. 
</p>

<p>
This has ended up in chapter 4. I will have to renumber everything. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgf87b181" class="outline-2">
<h2 id="orgf87b181"><span class="section-number-2">13</span> Documentation is important</h2>
<div class="outline-text-2" id="text-13">
<p>
Let's learn a bit about markdown and other simple markup languages
using the Wikipedia and the "Lessons learned" file we have been
working on for some time. A few words on how to link, on how to evolve
the documentation, how to evolve it along the rest of the programs,
and on how to generate better-quality documents 
from them. Spell check, things like that.
</p>

<p>
At the same time, practice familiarity with the filesystem and
navigating in it. For instance, navigate using Nautilus and them, open
the menu and click in "Open in a terminal". Filesystem navigation is a
very necessary skill, and one that is sometimes lacking in traditional
programming. 
</p>
</div>

<div id="outline-container-orgcde2002" class="outline-3">
<h3 id="orgcde2002"><span class="section-number-3">13.1</span> Actual development</h3>
<div class="outline-text-3" id="text-13-1">
<p>
This was scheduled for January 6th, we are being kind of intensive
lately. But it is gift-giving day in Spain and we played at one of the
games  that was given. Maybe an ocassion to gamify learning, but I
failed to see how. 
</p>
</div>
</div>
</div>

<div id="outline-container-org044d107" class="outline-2">
<h2 id="org044d107"><span class="section-number-2">14</span> Card shuffle</h2>
<div class="outline-text-2" id="text-14">
<p>
Talk about different ways of picking random elements out of an array,
or a whole bunch of them. The single objective of this class will be
to create a deck of French cards using the correct Unicode symbols and
all, and then an expression to shuffle them. 
</p>

<p>
Finally, it will be saved as a <a href="https://gist.github.com">gist</a> and shown to everyone for
comments. The <i>gist</i> will have to be written in Markdown, with a
description of what it is and a step-by-step explanation of the
expression. 
</p>
</div>

<div id="outline-container-org3355b41" class="outline-3">
<h3 id="org3355b41"><span class="section-number-3">14.1</span> Actual development</h3>
<div class="outline-text-3" id="text-14-1">
<p>
This has been an amazing session. With very little new material, just
<code>pick</code> and <code>roll</code>, it was about putting to practice what had been done
so far, including documentation and using GitHub for publishing
things. 
</p>

<p>
The dynamics was mostly self-organized, and with three persons, two
teams have been created. This the <a href="https://t.co/nUspT3ohZ1">first result</a> and the
<a href="https://gist.github.com/ElenaMerelo/3903f46a2d492dd0b76151054a598721">second team</a>. They have had a lot of fun while they were doing it, and
also while writing it down in Markdown. Different solutions, different
ways of understanding the structures, but all in all it shows that
Perl 6 is a great language, allowing to do things in very different
ways. Informative error messages also help quite a lot to get things
right. 
</p>
</div>
</div>
</div>

<div id="outline-container-org1f3c5de" class="outline-2">
<h2 id="org1f3c5de"><span class="section-number-2">15</span> It is so true</h2>
<div class="outline-text-2" id="text-15">
<p>
Learning a bit about Boolean values and how to work with them. I am
not sure how to proceed with this. We can do it fast or we can do it
good. It's probably better if we do it fast. 
</p>

<p>
The basic ideas is how Boolean types are the results of checks, and
what kind of things are considered true and not true. Also a primer on
unary/preffix operators and how to call them.  
</p>
</div>
