docs/sessions.html

<div id="outline-container-orgf00dfd1" class="outline-3">
<h3 id="orgf00dfd1"><span class="section-number-3">15.1</span> Actual development</h3>
<div class="outline-text-3" id="text-15-1">
<p>
It has been a whole week since the last class, and it is quite obvious
this is losing a bit of steam. Life gets in the way, we are entering
college exams period, plus the rest of the life, and we could barely
squeeze 20 minutes into the morning of January 15th. It is good,
anyway, that we can continue at all, and that we have been able to
learn a bit of logic, in a logical way, asking what seems true and
what is not true and wondering why an empty string is false, while a
non-empty string is true, even if it contains "False" and things like
that. 
</p>

<p>
Then we have continued to comparisons, and I have realized some of the
comparison glyphs, such as ≤ do not work. I'll have to check that out
and update the material.
</p>
</div>
</div>
</div>

<div id="outline-container-org5a5f7b0" class="outline-2">
<h2 id="org5a5f7b0"><span class="section-number-2">16</span> Filtering things</h2>
<div class="outline-text-2" id="text-16">
<p>
We are going to deal with how logical expressions allow us to filter
things. It's back again to simply working with Boolean logic, only we
are going to use implicit loops and all that. 
</p>

<p>
The important thing is to think about them as mathematical
functions. You apply a <i>filter function</i> to obtain one thing out of
other. We are going to deal also with belonging functions, and
finally, with using symbols as stand-ins for members of the array. I
realize it's a pretty jumbled up topic, but let's see. 
</p>
</div>

<div id="outline-container-org16bbe2c" class="outline-3">
<h3 id="org16bbe2c"><span class="section-number-3">16.1</span> Actual development</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Actually, it didn't went so badly after almost a month without any
class. Set up was pretty fast, and we were up and running in no
time. We took only half an hour on a Sunday afternoon, and the concept
of stand-ins (called <code>Whatever</code>), functions and so on went rather
well. Besides, it was a good chance to start explaining the
transformative nature of languages in a functional way: functions that
take something in and return something else according to some
expression.
</p>
</div>
</div>
</div>

<div id="outline-container-org51f697a" class="outline-2">
<h2 id="org51f697a"><span class="section-number-2">17</span> Computational thinking</h2>
<div class="outline-text-2" id="text-17">
<p>
We do need to talk about how computers do things, and how we make
computers do things. Let's go back to the initial design thinking
stage, where we talked about what we eventually wanted to do. We might
not be able to finish it, but we can create a rough prototype along
these sessions and maybe come up with something way cooler. 
</p>

<p>
After a round of remembering and maybe changing, let us go back to
what we can <i>actually</i> do and let us realize a few things.
</p>

<ul class="org-ul">
<li><b>The world is programmable</b>: everything is built around computers,
the Internet and applications and we can use computers to fulfill
our curiosity about the world, and even make it change if we
can. The world has an API, application programming interface, which
we can use to read, and sometimes, write, what is there. Pretty much
everything out there has an API: your class system, the Wikipedia,
Twitter, Spotify&#x2026;</li>
<li><b>Programming gives you power</b>: because since everything can be
programmable, it helps you get your job done in less time and with
more added value. It allows you to automatize repetitive tasks, to
keep track of things, to understand better what is going on and what
might happen in the future.</li>
<li><b>We program in a community</b>: so there might always be someone out
there to help us in whatever we need, answer to our doubts, and
maybe even help us build something. We can also help someone build
something, and then start to be part of the community.</li>
</ul>

<p>
That is why programming is seldom the matter of a single language or
tool. In order to program the world, you have to know the world. But
you also have to know how to break down a problem to put it into a
computer. This is usually called
<a href="https://docs.google.com/document/d/1i0wg-BMG3TdwsShAyH_0Z1xpFnpVcMvpYJceHGWex_c/edit">computational thinking</a> and consists in breaking down a problem in
several parts via these processes
</p>
<ul class="org-ul">
<li>First would be  <b>decomposition</b>, breaking down the problem in parts that can be
managed separately.</li>
<li><b>Abstraction</b>: understand the processes behind a problem in terms of
what is essential, not its appearance. In this process we might find
parts of the problem have been solved with off-the-shelf software
that we will use, as long as it is free software. <b>Pattern
recognition</b> helps here to find the correct level of abstraction for
a particular problem and common elements in different problems.</li>
<li><b>Data collection</b>: how to get data into the system so that it can
solve the problem</li>
<li><b>Data representation</b>: there are many ways of representing data in a
computer, with different performance and constraints. Choosing the
best one is key to being able to solve the problem quickly and
efficiently.</li>
</ul>
</div>
</div>


<div id="outline-container-orge390925" class="outline-2">
<h2 id="orge390925"><span class="section-number-2">18</span> Back to the command line</h2>
<div class="outline-text-2" id="text-18">
<p>
We need to learn a bit about the command line: when we are actually in
it, what kind of orders are available, and some basic stuff, mainly in
order to combine different commands to perform tasks. 
</p>

<p>
In this session, we will also experiment with somebody else <i>leading</i>
or explaining things. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Juan J. merelo</p>
<p class="date">Created: 2017-02-19 dom 17:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
